In [3]:
%load_ext sql
%sql mysql+mysqlconnector://root:root@localhost/carRental

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [4]:
%%sql
use carRental;

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [100]:
%%sql
create table if not exists Vehicle(
    vehicleID int auto_increment primary key,
    make varchar(50) not null,
    model varchar(50) not null,
    year int not null,
    dailyRate decimal(10,2) not null,
    status bit not null,
    passengerCapacity int not null,
    engineCapacity int not null
)

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [101]:
%%sql
create table if not exists Customer(
    customerID int auto_increment primary key,
    firstName varchar(100) not null,
    lastName varchar(100) not null,
    email varchar(255) unique not null,
    phoneNumber varchar(20) unique not null
)

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [102]:
%%sql
create table if not exists Lease(
    leaseID int auto_increment primary key,
    vehicleID  int not null,
    customerID int not null,
    startDate date not null,
    endDate date not null,
    leaseType varchar(10) not null,
    foreign key (vehicleID) references Vehicle(vehicleID) on delete cascade,
    foreign key (customerID) references Customer(customerID) on delete cascade
)

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [103]:
%%sql
create table if not exists Payment(
    paymentID int auto_increment primary key,
    leaseID int not null,
    paymentDate date null,
    amount decimal(10,2),
    foreign key (leaseId) references Lease(leaseID) on delete cascade
);

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [104]:
%%sql
show tables;

 * mysql+mysqlconnector://root:***@localhost/carRental
4 rows affected.

[('customer',), ('lease',), ('payment',), ('vehicle',)]

In [105]:
%%sql
INSERT INTO Vehicle (make, model, year, dailyRate, status, passengerCapacity, engineCapacity) VALUES
('Toyota', 'Camry', 2022, 50.00, 1, 4, 1450),
('Honda', 'Civic', 2023, 45.00, 1, 7, 1500),
('Ford', 'Focus', 2022, 48.00, 0, 4, 1400),
('Nissan', 'Altima', 2023, 52.00, 1, 7, 1200),
('Chevrolet', 'Malibu', 2022, 47.00, 1, 4, 1800),
('Hyundai', 'Sonata', 2023, 49.00, 0, 7, 1400),
('BMW', '3 Series', 2023, 60.00, 1, 7, 2499),
('Mercedes', 'C-Class', 2022, 58.00, 1, 8, 2599),
('Audi', 'A4', 2022, 55.00, 0, 4, 2500),
('Lexus', 'ES', 2023, 54.00, 1, 4, 2500);

 * mysql+mysqlconnector://root:***@localhost/carRental
10 rows affected.

[]

In [106]:
%%sql
INSERT INTO Customer (firstName, lastName, email, phoneNumber) VALUES
('John', 'Doe', 'johndoe@example.com', '555-555-5555'),
('Jane', 'Smith', 'janesmith@example.com', '555-123-4567'),
('Robert', 'Johnson', 'robert@example.com', '555-789-1234'),
('Sarah', 'Brown', 'sarah@example.com', '555-456-7890'),
('David', 'Lee', 'david@example.com', '555-987-6543'),
('Laura', 'Hall', 'laura@example.com', '555-234-5678'),
('Michael', 'Davis', 'michael@example.com', '555-876-5432'),
('Emma', 'Wilson', 'emma@example.com', '555-432-1098'),
('William', 'Taylor', 'william@example.com', '555-321-6547'),
('Olivia', 'Adams', 'olivia@example.com', '555-765-4321');

 * mysql+mysqlconnector://root:***@localhost/carRental
10 rows affected.

[]

In [107]:
%%sql
INSERT INTO Lease (vehicleID, customerID, startDate, endDate, leaseType) VALUES
(1, 1, '2023-01-01', '2023-01-05', 'Daily'),
(2, 2, '2023-02-15', '2023-02-28', 'Monthly'),
(3, 3, '2023-03-10', '2023-03-15', 'Daily'),
(4, 4, '2023-04-20', '2023-04-30', 'Monthly'),
(5, 5, '2023-05-05', '2023-05-10', 'Daily'),
(4, 3, '2023-06-15', '2023-06-30', 'Monthly'),
(7, 7, '2023-07-01', '2023-07-10', 'Daily'),
(8, 8, '2023-08-12', '2023-08-15', 'Monthly'),
(3, 3, '2023-09-07', '2023-09-10', 'Daily'),
(10, 10, '2023-10-10', '2023-10-31', 'Monthly');

 * mysql+mysqlconnector://root:***@localhost/carRental
10 rows affected.

[]

In [108]:
%%sql
INSERT INTO Payment (leaseID, paymentDate, amount) VALUES
(1, '2023-01-03', 200.00),
(2, '2023-02-20', 1000.00),
(3, '2023-03-12', 75.00),
(4, '2023-04-25', 900.00),
(5, '2023-05-07', 60.00),
(6, '2023-06-18', 1200.00),
(7, '2023-07-03', 40.00),
(8, '2023-08-14', 1100.00),
(9, '2023-09-09', 80.00),
(10, '2023-10-25', 1500.00);

 * mysql+mysqlconnector://root:***@localhost/carRental
10 rows affected.

[]

In [109]:
%%sql
# 1. Update the daily rate for a Mercedes car to 68.
update vehicle set dailyRate=68 where make='Mercedes';

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[]

In [110]:
%%sql
select * from vehicle where make='Mercedes';

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(8, 'Mercedes', 'C-Class', 2022, Decimal('68.00'), 1, 8, 2599)]

In [111]:
%%sql
# 2. Delete a specific customer and all associated leases and payments.
delete from payment
where leaseId in (select leaseId from lease where customerId=3);

delete from lease
where customerId = 3;

delete from customer
where customerId=3;

 * mysql+mysqlconnector://root:***@localhost/carRental
3 rows affected.
3 rows affected.
1 rows affected.

[]

In [112]:
%%sql
select * from customer limit 3;

 * mysql+mysqlconnector://root:***@localhost/carRental
3 rows affected.

[(1, 'John', 'Doe', 'johndoe@example.com', '555-555-5555'),
 (2, 'Jane', 'Smith', 'janesmith@example.com', '555-123-4567'),
 (4, 'Sarah', 'Brown', 'sarah@example.com', '555-456-7890')]

In [113]:
%%sql
select * from payment limit 3;

 * mysql+mysqlconnector://root:***@localhost/carRental
3 rows affected.

[(1, 1, datetime.date(2023, 1, 3), Decimal('200.00')),
 (2, 2, datetime.date(2023, 2, 20), Decimal('1000.00')),
 (4, 4, datetime.date(2023, 4, 25), Decimal('900.00'))]

In [114]:
%%sql
select * from lease limit 3;

 * mysql+mysqlconnector://root:***@localhost/carRental
3 rows affected.

[(1, 1, 1, datetime.date(2023, 1, 1), datetime.date(2023, 1, 5), 'Daily'),
 (2, 2, 2, datetime.date(2023, 2, 15), datetime.date(2023, 2, 28), 'Monthly'),
 (4, 4, 4, datetime.date(2023, 4, 20), datetime.date(2023, 4, 30), 'Monthly')]

In [25]:
%%sql
# due to on delete cascade all the child tables will be deleted
delete from customer 
where customerId = 4;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[]

In [115]:
%%sql
# 3. Rename the "paymentDate" column in the Payment table to "transactionDate"
Alter table payment 
rename column paymentDate to transactionDate;

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [116]:
%%sql
select * from payment limit 2;

 * mysql+mysqlconnector://root:***@localhost/carRental
2 rows affected.

[(1, 1, datetime.date(2023, 1, 3), Decimal('200.00')),
 (2, 2, datetime.date(2023, 2, 20), Decimal('1000.00'))]

In [120]:
%%sql
# 4. Find a specific customer by email.
select * from customer
where email='johndoe@example.com';

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(1, 'John', 'Doe', 'johndoe@example.com', '555-555-5555')]

In [122]:
%%sql
# 5. Get active leases for a specific customer.
select * from lease
where customerid=5 and (enddate>=curdate() or month(enddate)>=3);

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(5, 5, 5, datetime.date(2023, 5, 5), datetime.date(2023, 5, 10), 'Daily')]

In [123]:
%%sql
# 6. Find all payments made by a customer with a specific phone number
select p.*
from payment p
join lease l on p.leaseID=l.leaseID
join customer c on l.customerid = c.customerID
where c.phonenumber='555-123-4567';

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(2, 2, datetime.date(2023, 2, 20), Decimal('1000.00'))]

In [124]:
%%sql
# 7. Calculate the average daily rate of all available cars.
select avg(dailyrate) as Average_Daily_Rate
from vehicle
where status=1;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(Decimal('53.714286'),)]

In [125]:
%%sql
#  8. Find the car with the highest daily rate.
select make as Car from vehicle 
order by dailyrate desc
limit 1;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[('Mercedes',)]

In [126]:
%%sql
# 9. Retrieve all cars leased by a specific customer.
select v.*
from vehicle v 
join lease l on v.vehicleid=l.vehicleid
where l.customerid=7;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(7, 'BMW', '3 Series', 2023, Decimal('60.00'), 1, 7, 2499)]

In [127]:
%%sql
# 10. Find the details of the most recent lease.
select * from lease
order by startdate desc
limit 1;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(10, 10, 10, datetime.date(2023, 10, 10), datetime.date(2023, 10, 31), 'Monthly')]

In [87]:
%%sql
# 11. List all payments made in the year 2023.
select * from payment
where year(transactiondate)=2023;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(4, 4, datetime.date(2023, 4, 25), Decimal('900.00'))]

In [90]:
%%sql
# 12. Retrieve customers who have not made any payments.
select c.* from customer c
left join lease l on c.customerid = l.customerid
left join payment p on l.leaseid = p.leaseid
where p.paymentid is null;

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [91]:
%%sql
# 13. Retrieve Car Details and Their Total Payments.
select v.vehicleid,v.make, v.model, sum(p.amount) as Total_Payments  from vehicle v
left join lease l on v.vehicleid = l.vehicleid
left join payment p on l.leaseid = p.leaseid
group by v.vehicleid,v.make, v.model

 * mysql+mysqlconnector://root:***@localhost/carRental
10 rows affected.

[(1, 'Toyota', 'Camry', Decimal('200.00')),
 (2, 'Honda', 'Civic', Decimal('1000.00')),
 (3, 'Ford', 'Focus', None),
 (4, 'Nissan', 'Altima', Decimal('900.00')),
 (5, 'Chevrolet', 'Malibu', Decimal('60.00')),
 (6, 'Hyundai', 'Sonata', Decimal('1200.00')),
 (7, 'BMW', '3 Series', Decimal('40.00')),
 (8, 'Mercedes', 'C-Class', Decimal('1100.00')),
 (9, 'Audi', 'A4', Decimal('80.00')),
 (10, 'Lexus', 'ES', Decimal('1500.00'))]

In [92]:
%%sql
# 14. Calculate Total Payments for Each Customer.
select C.customerID, C.firstName, C.lastName, sum(amount) as Total_payements from customer C
left join lease l on c.customerid = l.customerid
left join payment p on l.leaseid = p.leaseid
group by C.customerID, C.firstName, C.lastName;

 * mysql+mysqlconnector://root:***@localhost/carRental
9 rows affected.

[(1, 'John', 'Doe', Decimal('200.00')),
 (2, 'Jane', 'Smith', Decimal('1000.00')),
 (4, 'Sarah', 'Brown', Decimal('900.00')),
 (5, 'David', 'Lee', Decimal('60.00')),
 (6, 'Laura', 'Hall', Decimal('1200.00')),
 (7, 'Michael', 'Davis', Decimal('40.00')),
 (8, 'Emma', 'Wilson', Decimal('1100.00')),
 (9, 'William', 'Taylor', Decimal('80.00')),
 (10, 'Olivia', 'Adams', Decimal('1500.00'))]

In [93]:
%%sql
# 15. List Car Details for Each Lease.
SELECT L.leaseID, C.firstName, C.lastName, V.make, V.model, L.startDate, L.endDate, L.leaseType
FROM Lease L
JOIN Customer C ON L.customerID = C.customerID
JOIN Vehicle V ON L.vehicleID = V.vehicleID;

 * mysql+mysqlconnector://root:***@localhost/carRental
9 rows affected.

[(1, 'John', 'Doe', 'Toyota', 'Camry', datetime.date(2025, 1, 1), datetime.date(2025, 6, 30), 'Monthly'),
 (2, 'Jane', 'Smith', 'Honda', 'Civic', datetime.date(2024, 2, 15), datetime.date(2024, 8, 28), 'Daily'),
 (4, 'Sarah', 'Brown', 'Nissan', 'Altima', datetime.date(2023, 4, 20), datetime.date(2023, 4, 30), 'Monthly'),
 (5, 'David', 'Lee', 'Chevrolet', 'Malibu', datetime.date(2025, 5, 5), datetime.date(2025, 7, 10), 'Daily'),
 (6, 'Laura', 'Hall', 'Hyundai', 'Sonata', datetime.date(2024, 6, 15), datetime.date(2024, 12, 30), 'Monthly'),
 (7, 'Michael', 'Davis', 'BMW', '3 Series', datetime.date(2025, 7, 1), datetime.date(2025, 9, 10), 'Daily'),
 (8, 'Emma', 'Wilson', 'Mercedes', 'C-Class', datetime.date(2024, 8, 12), datetime.date(2024, 8, 15), 'Monthly'),
 (9, 'William', 'Taylor', 'Audi', 'A4', datetime.date(2025, 9, 7), datetime.date(2025, 12, 10), 'Daily'),
 (10, 'Olivia', 'Adams', 'Lexus', 'ES', datetime.date(2024, 10, 10), datetime.date(2024, 10, 31), 'Monthly')]

In [47]:
%%sql
# 16. Retrieve Details of Active Leases with Customer and Car Information.
SELECT L.leaseID, C.firstName, C.lastName, V.make, V.model, L.startDate, L.endDate
FROM Lease L
JOIN Customer C ON L.customerID = C.customerID
JOIN Vehicle V ON L.vehicleID = V.vehicleID
WHERE L.endDate >= CURDATE();

 * mysql+mysqlconnector://root:***@localhost/carRental
0 rows affected.

[]

In [94]:
%%sql
# 17. Find the Customer Who Has Spent the Most on Leases.
select c.customerID, c.firstName, c.lastName, sum(p.amount) as totalSpent
from customer c
join lease l on c.customerID = l.customerID
join payment p on l.leaseID = p.leaseID
group by c.customerID, c.firstName, c.lastName
order by totalspent desc 
limit 1;

 * mysql+mysqlconnector://root:***@localhost/carRental
1 rows affected.

[(10, 'Olivia', 'Adams', Decimal('1500.00'))]

In [95]:
%%sql
# 18. List All Cars with Their Current Lease Information.
select v.vehicleID, v.make, v.model, l.leaseID, l.startDate, l.endDate, c.firstName, c.lastName
from vehicle v
left join lease l on v.vehicleID = v.vehicleID 
left join customer c on l.customerID = c.customerID
limit 10

 * mysql+mysqlconnector://root:***@localhost/carRental
10 rows affected.

[(1, 'Toyota', 'Camry', 10, datetime.date(2024, 10, 10), datetime.date(2024, 10, 31), 'Olivia', 'Adams'),
 (1, 'Toyota', 'Camry', 9, datetime.date(2025, 9, 7), datetime.date(2025, 12, 10), 'William', 'Taylor'),
 (1, 'Toyota', 'Camry', 8, datetime.date(2024, 8, 12), datetime.date(2024, 8, 15), 'Emma', 'Wilson'),
 (1, 'Toyota', 'Camry', 7, datetime.date(2025, 7, 1), datetime.date(2025, 9, 10), 'Michael', 'Davis'),
 (1, 'Toyota', 'Camry', 6, datetime.date(2024, 6, 15), datetime.date(2024, 12, 30), 'Laura', 'Hall'),
 (1, 'Toyota', 'Camry', 5, datetime.date(2025, 5, 5), datetime.date(2025, 7, 10), 'David', 'Lee'),
 (1, 'Toyota', 'Camry', 4, datetime.date(2023, 4, 20), datetime.date(2023, 4, 30), 'Sarah', 'Brown'),
 (1, 'Toyota', 'Camry', 2, datetime.date(2024, 2, 15), datetime.date(2024, 8, 28), 'Jane', 'Smith'),
 (1, 'Toyota', 'Camry', 1, datetime.date(2025, 1, 1), datetime.date(2025, 6, 30), 'John', 'Doe'),
 (2, 'Honda', 'Civic', 10, datetime.date(2024, 10, 10), datetime.date(2024, 10, 31), 'Olivia', 'Adams')]